// Generated from local Company of Heroes 2 archives (squad_veterancy_ext).
export const veterancyEffects: Record<number, Record<number, string[]>> = {
  '16': {
    '1': ['перезарядка способности · способность ×'],
    '2': ['перезарядка способности · способность ×'],
  },
  '46': {
    '1': ['скорость поворота · отряд ×', 'перезарядка оружия · оружие ×'],
    '2': ['точность оружия · оружие ×'],
  },
  '64': {
    '2': [
      'точность оружия · оружие ×',
      'перезарядка способности · способность ×',
      'получаемый урон · отряд ×',
    ],
    '3': ['перезарядка (cooldown) · оружие ×', 'уворот (получаемая точность) · сущность ×'],
  },
  '65': {
    '2': [
      'точность оружия · оружие ×',
      'перезарядка способности · способность ×',
      'получаемый урон · отряд ×',
    ],
    '3': ['перезарядка (cooldown) · оружие ×', 'уворот (получаемая точность) · сущность ×'],
  },
  '67': {
    '2': ['перезарядка способности · способность ×'],
  },
  '68': {
    '1': ['уворот (получаемая точность) · отряд ×'],
    '3': ['точность оружия · оружие ×'],
  },
  '69': {
    '2': [
      'точность оружия · оружие ×',
      'перезарядка способности · способность ×',
      'уворот (получаемая точность) · отряд ×',
    ],
    '3': ['перезарядка (cooldown) · оружие ×', 'уворот (получаемая точность) · сущность ×'],
  },
  '70': {
    '1': ['перезарядка способности · способность ×'],
    '2': ['точность оружия · оружие ×', 'уворот (получаемая точность) · отряд ×'],
    '3': ['перезарядка (cooldown) · оружие ×'],
  },
  '71': {
    '1': ['перезарядка способности · способность ×'],
    '2': ['точность оружия · оружие ×', 'уворот (получаемая точность) · отряд ×'],
    '3': ['перезарядка (cooldown) · оружие ×'],
  },
  '72': {
    '1': ['уворот (получаемая точность) · отряд ×'],
    '2': [
      'перезарядка (cooldown) · оружие ×',
      'точность оружия · оружие ×',
      'перезарядка способности · способность ×',
    ],
    '3': ['точность оружия · оружие ×', 'уворот (получаемая точность) · сущность ×'],
  },
  '73': {
    '2': ['точность оружия · оружие ×'],
    '3': [
      'уворот (получаемая точность) · отряд ×',
      'перезарядка (cooldown) · оружие ×',
      'уворот (получаемая точность) · сущность ×',
    ],
  },
  '74': {
    '2': ['перезарядка (cooldown) · оружие ×', 'перезарядка оружия · оружие ×'],
    '3': ['перезарядка (cooldown) · оружие ×', 'перезарядка оружия · оружие ×'],
  },
  '76': {
    '1': ['перезарядка оружия · оружие ×'],
    '2': ['скорость поворота · отряд ×'],
    '3': ['перезарядка оружия · оружие ×'],
  },
  '77': {
    '1': ['перезарядка оружия · оружие ×'],
    '2': [
      'скорость поворота · отряд ×',
      'точность оружия · оружие ×',
      'перезарядка оружия · оружие ×',
    ],
  },
  '78': {
    '1': ['броня · отряд ×', 'перезарядка оружия · оружие ×'],
    '2': [
      'перезарядка оружия · оружие ×',
      'скорость поворота · сущность ×',
      'максимальная скорость · сущность ×',
    ],
  },
  '79': {
    '1': [
      'максимальная скорость · сущность ×',
      'скорость поворота · сущность ×',
      'перезарядка оружия · оружие ×',
    ],
    '2': ['точность оружия · оружие ×', 'перезарядка оружия · оружие ×'],
  },
  '81': {
    '1': [
      'точность оружия · оружие ×',
      'уворот (получаемая точность) · сущность ×',
      'длина очереди · оружие ×',
    ],
    '2': ['скорость поворота · сущность ×', 'максимальная скорость · сущность ×'],
  },
  '82': {
    '1': ['перезарядка способности · способность ×'],
  },
  '83': {
    '1': ['максимальная скорость · сущность ×', 'скорость поворота · сущность ×'],
    '2': ['перезарядка (cooldown) · оружие ×'],
  },
  '84': {
    '1': ['перезарядка способности · способность ×'],
    '2': ['скорость поворота · отряд ×', 'дальность оружия · оружие ×'],
  },
  '85': {
    '1': ['перезарядка (cooldown) · оружие ×'],
    '2': [
      'скорость поворота · сущность ×',
      'максимальная скорость · сущность ×',
      'перезарядка оружия · оружие ×',
    ],
  },
  '86': {
    '1': ['скорость горизонтальной наводки · оружие ×', 'броня · сущность ×'],
    '2': ['перезарядка оружия · оружие ×', 'скорость поворота · сущность ×'],
  },
  '87': {
    '1': ['перезарядка способности · способность ×'],
  },
  '88': {
    '1': ['броня · отряд ×', 'скорость горизонтальной наводки · оружие ×'],
    '2': ['перезарядка оружия · оружие ×', 'скорость поворота · сущность ×'],
  },
  '89': {
    '1': ['броня · отряд ×', 'скорость горизонтальной наводки · оружие ×'],
    '2': ['перезарядка оружия · оружие ×', 'скорость поворота · сущность ×'],
  },
  '91': {
    '1': ['точность оружия · оружие ×', 'уворот (получаемая точность) · сущность ×'],
    '2': [
      'скорость поворота · сущность ×',
      'максимальная скорость · сущность ×',
      'точность оружия · оружие ×',
    ],
  },
  '93': {
    '1': ['броня · отряд ×', 'перезарядка оружия · оружие ×'],
    '2': [
      'перезарядка оружия · оружие ×',
      'скорость поворота · сущность ×',
      'максимальная скорость · сущность ×',
    ],
  },
  '95': {
    '1': [
      'дальность оружия · оружие +',
      'точность оружия · оружие ×',
      'скорость горизонтальной наводки · оружие ×',
    ],
    '2': [
      'перезарядка оружия · оружие ×',
      'скорость поворота · сущность ×',
      'максимальная скорость · сущность ×',
    ],
  },
  '140': {
    '1': ['скорость поворота · сущность ×'],
    '2': [
      'перезарядка оружия · оружие ×',
      'точность оружия · оружие ×',
      'урон оружия · оружие ×',
      'дальность оружия · оружие +',
    ],
  },
  '145': {
    '1': ['перезарядка способности · способность ×'],
    '2': ['скорость поворота · отряд ×', 'дальность оружия · оружие ×'],
    '3': ['перезарядка оружия · оружие ×'],
  },
  '150': {
    '1': ['перезарядка (cooldown) · оружие ×'],
    '2': [
      'перезарядка (cooldown) · оружие ×',
      'скорость поворота · сущность ×',
      'максимальная скорость · сущность ×',
      'перезарядка оружия · оружие ×',
    ],
    '3': ['урон оружия · оружие ×', 'дальность оружия · оружие ×'],
  },
  '154': {
    '1': ['скорость горизонтальной наводки · оружие ×'],
    '2': ['перезарядка оружия · оружие ×', 'скорость поворота · сущность ×'],
    '3': ['точность оружия · оружие ×'],
  },
  '161': {
    '1': ['перезарядка способности · способность ×'],
    '2': ['перезарядка способности · способность ×'],
  },
  '162': {
    '1': ['точность оружия · оружие ×', 'уворот (получаемая точность) · сущность ×'],
    '2': ['скорость поворота · сущность ×', 'максимальная скорость · сущность ×'],
  },
  '163': {
    '1': ['дальность оружия · оружие +', 'скорость горизонтальной наводки · оружие ×'],
    '2': ['перезарядка оружия · оружие ×', 'точность оружия · оружие ×'],
    '3': ['скорость поворота · сущность ×', 'максимальная скорость · сущность ×'],
  },
  '164': {
    '1': ['скорость горизонтальной наводки · оружие ×'],
    '2': ['перезарядка оружия · оружие ×', 'скорость поворота · сущность ×'],
    '3': ['точность оружия · оружие ×'],
  },
  '165': {
    '2': [
      'точность оружия · оружие ×',
      'уворот (получаемая точность) · отряд ×',
      'перезарядка (cooldown) · оружие ×',
    ],
  },
  '168': {
    '1': ['уворот (получаемая точность) · отряд ×'],
    '3': ['точность оружия · оружие ×'],
  },
};
